#include <stdio.h>

int main() {
   
   
    int i = 1, j = 2, k; // กําหนดค่าตัวเเปร i,j,k เป็นint โดย i=1,j=2,kยังไม่กำหนดค่า
    
    printf("i = %d, j = %d, k = %d\n",i,j,k); // แสดงค่าเริ่มต้นของตัวเเปร i,j,k
    
    k = i + j;
    printf("k = i + j =%d\n",k); // i+j = 1+2 = 3 ดังนั้น k จะมีค่าเป็น 3 ตามสมการ

    i = i + (k * j);
    printf("i = i + (k * j) = %d\n",i); // i+(k*j) = 1 + (3 * 2) = 1 + 6 = 7 ดังนั้น i จึงมีค่าเป็น 7

    j = i/2;
    printf("j = i / 2 = %d\n",j); // i/2 = 7/2 = 3 คิดแค่ส่วนเต็มที่หารได้ คำตอบจึงเป็น 3 j =3

    k = i % 2;
    printf("k = i %% 2 = %d\n",k); // i%2 = 7%2 = 1 คิดแค่เศษที่เหลือจากการหาร ค่าของ k จึงเป็น 1

    i = (j + k) * 3;
    printf("i = (j + k) * 3 = %d\n",i); // (j+k)*3 = (3+1)*3 = 4*3 = 12 ทำในวงเล็บก่อนแล้วคูณ 3 ค่าของ i จึงเป็น 12

     return 0;
}