#include <stdio.h>
int main() {
    int a = 5, b = 17;
    float c = 8.5, d = 4.0;


    printf("a = %d, b = %d, c = %.1f, d = %.1f\n", a, b, c, d);// แสดงค่าเริ่มต้นของตัวแปร a, b, c และ d

    //  แสดงผลของ d + a
    printf("d + a = %.1f\n", d + a);  // d เป็น float + กับa เป็น int = 4.0+5 แต่ d เป็น float คำตอบจึง = 9.0

    //  แสดงผลของ a - b
    printf("a - b = %d\n", a - b);  // a เป็น int - กับb เป็น int = 17+5 a และ b คำตอบจึง = -12

    //  แสดงผลของ c * d
    printf("c * d = %.2f\n", c * d);  // c เป็น float * กับ d เป็น float = 8.5*4.0 คำตอบจึง = 34.00
    
    //  แสดงผลของ a * c
    printf("a * c = %.2f\n", a * c);  // a เป็น int * กับ c เป็น float = 5*8.5 แต่ c เป็น float คำตอบจึง = 42.50 
    //  แสดงผลของ c / d
    printf("c / d = %.2f\n", c / d);  // c เป็น float / กับ d เป็น float = 8.5/4.0 คำตอบจึง = 2.1.

    //  แสดงผลของ b / c
    printf("b / c = %.2f\n", b / c);  // b เป็น int / กับ c เป็น float = 17/8.5 แต่ c เป็น float คำตอบจึง = 2.00

    //  แสดงผลของ a %% b
    printf("a %% b = %d\n", (int)a % b);  // a เป็น int % กับ b เป็น int = 5%17 คำตอบจึง = 5

    //  แสดงผลของ c %% a
    printf("c %% a = %d\n", (int) c % a); // c เป็น float แต่ใช้ % กับ int = 8.5%5 คำตอบจึง = 3

    //  แสดงผลของ c %% d
    printf("c %% d = %.1f\n", c- (int)c ); // c เป็น float แต่ใช้ % กับ int = 8.5%4.0  คำตอบจึง = 0.5

    return 0;
}
//อภิปรายผลจากการทดลองค่าของตัวเเปรที่กําหนดค่าไว้จะเปลี่ยนเเปลงไปตามการคํานวณที่เกิดขึ้นและการประกาศว่าจำนวนเต็มนั้นเป็น int,float ในเเต่ละบรรทัด
//int จะเเสดงลลัพธ์เป็นจํวนเต็ม ส่วน float จะเเสดงผลลัพธ์เป็นทศนิยม
//การคํานวณที่ใช้ % จะต้องเป็น int เท่านั้น หากใช้ float จะต้องเปลี่ยนเป็น int ก่อน ไม่งั้นจะเกิดการerrorและหาค่าไม่ได้
//การคํานวณที่ใช้ + - * / ถ้านํา int มาคํานวณกับ float ผลลัพธ์จะออกมาเป็น float เสมอเพราะ float อยู่ลำดับชั้นที่สูงกว่า int