#include <stdio.h>

int main() {
    // 5 * 2 = 10 → -2 + 10 = 8 ทำคูณก่อน
    int A = -2 + 5 * 2;           
    
    // 10 / 2 = 5 → 5 * 3 = 15 ทำหารก่อน
    int B = 10 / 2 * 3;           
    
    // 4 % 2 = 0 → 3 * 0 = 0 → 6 / 2 = 3 → 3 + 0 = 3 หาเศษของ%ก่อน แล้วคูณ แล้วหาร
    int C = 6 / 2 + 3 * (4 % 2);  
    
    // 5 + 2 = 7 → 7 * 15 = 105 → 105 % 4 = 1 ทำบวกก่อน แล้วคูณ แล้วหาเศษของ%
    int D = (5 + 2) * 15 % 4;     
    
    // 2 * 2 = 4 → 6 / 2 = 3 → 6 + 4 = 10 → 10 - 3 = 7 ทำคูณก่อน แล้วหาร แล้วบวก แล้วลบ
    int E = 6 + 2 * 2 - 6 / 2;    
   
    // 3 * 2 = 6 → 5 + 6 = 11 → 8 / 4 = 2 → 11 - 2 = 9 → 6 % 5 = 1 → 9 + 1 = 10 ทำคูณก่อน แล้วบวก ,หาร,ลบ,หาเศษของ%
    int F = 5 + 3 * 2 - 8 / 4 + (6 % 5); 
   
    // 4 + 3 = 7 → 7 * 2 = 14 → 2 + 3 = 5 → 10 / 5 = 2 → 14 - 2 = 12 ทำบวก่อน แล้วคูณ แล้วบวก แล้วหาร
    int G = (4 + 3) * 2 - 10 / (2 + 3);  

    // แสดงค่าผลลัพธ์ของแต่ละตัวแปร
    printf("A = %d\n", A);
    printf("B = %d\n", B);
    printf("C = %d\n", C);
    printf("D = %d\n", D);
    printf("E = %d\n", E);
    printf("F = %d\n", F);
    printf("G = %d\n", G);

    return 0;
}
